ЛИС2/src/Catalogs/ИсточникиЗагрязнения/ИсточникиЗагрязнения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ИсточникиЗагрязнения</name>
  <comment>В справочнике содержатся сведения об источниках загрязнения атмосферы (ИЗА), характеристики выбросов загрязняющих веществ.</comment>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <attributes>
    <name>ПроизводственнаяПлощадка</name>
    <type>
      <types>CatalogRef.ПроизводственныеПлощадки</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦехУчасток</name>
    <type>
      <types>CatalogRef.ЦехаУчастки</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидИВ</name>
    <type>
      <types>CatalogRef.ВидыИВ</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипИсточника</name>
    <type>
      <types>EnumRef.ТипыИсточниковВыбросов</types>
    </type>
  </attributes>
  <attributes>
    <name>ГПУ</name>
    <type>
      <types>CatalogRef.ГазопылевыеУстановки</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерИЗА</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>4</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СсылкаОЗ</name>
    <type>
      <types>CatalogRef.ДизельныеУстановкиЭСН</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерИсточникаВыделения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>4</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяРаботы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяРаботыГод</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Диаметр</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВысотаИсточника</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаличиеВентилятора</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МаркаВентилятора</name>
    <type>
      <types>CatalogRef.МаркиВентиляторов</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроизводительностьВентилятора</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>8</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДлинаУчастка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ШиринаУчастка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>8</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВысотаУчастка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МетанПоУчетуДУ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидТрубы</name>
    <type>
      <types>EnumRef.ВидыТрубыИЗА</types>
    </type>
  </attributes>
  <attributes>
    <name>ДлинаТруба</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ШиринаТруба</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипГПА</name>
    <type>
      <types>CatalogRef.ТипыГПА</types>
    </type>
  </attributes>
  <attributes>
    <name>КоординатыX1</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоординатыX2</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоординатыY1</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоординатыY2</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПараметрГВССкорость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>11</precision>
        <scale>7</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПараметрГВСТемпература</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПараметрГВСОбъем</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоИВ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеЭксплуатации</name>
    <type>
      <types>EnumRef.СостояниеЭксплуатации</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипТерриторииОбъекта</name>
    <type>
      <types>EnumRef.ТипыТерриторийОбъектов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВедетсяКонтрольВыбросов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВырабатываетЭлектроТеплоЭнергию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойИсточникВыделения</name>
    <type>
      <types>CatalogRef.ИсточникиЗагрязнения</types>
    </type>
  </attributes>
  <attributes>
    <name>ПризнакОсобоОхраняемойТерритории</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

ЛИС2/src/Enums/ВидыТрубыИЗА/ВидыТрубыИЗА.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыТрубыИЗА</name>
  <enumValues>
    <name>Круглая</name>
  </enumValues>
  <enumValues>
    <name>Прямоугольная</name>
  </enumValues>
</mdclass:Enum>

ЛИС2/src/Catalogs/ИсточникиЗагрязнения/ManagerModule.bsl
#Область СлужебныеПроцедурыИФункции

// Возращает имена связанных с источником загрязнения
// регистров по виду источника загрязнения.
//
// Параметры:
// ВидИВ - СправочникСсылка.ВидыИВ - Вид источника загрязнения.
//
// Возвращаемое значение:
// Массив - Массив имен связанных регистров.
//
Функция ПолучитьИменаСвязанныхРегистраПоВидуИВ(ВидИВ) Экспорт 
	
	МассивИменРегистров = Новый Массив;
	
	Если ВидИВ = ПредопределенноеЗначение("Справочник.ВидыИВ.ТрубчатаяПечь") Тогда 
		
		МассивИменРегистров.Добавить("СведенияОТрубчатыхПечах");
		
	ИначеЕсли ВидИВ = ПредопределенноеЗначение("Справочник.ВидыИВ.Котельная") Тогда	
		
		// 28.07.17
		//МассивИменРегистров.Добавить("КотлыИсточниковВыделения");
		
		МассивИменРегистров.Добавить("КотлыИВ");
		МассивИменРегистров.Добавить("ПеременныеДанныеОКотлах");
		МассивИменРегистров.Добавить("СведенияОКотельных");
		
	// !!! Наполнить функцию по остальным видам ИВ
	
	КонецЕсли;	
	
	Возврат МассивИменРегистров;	
		
КонецФункции // Функция ПолучитьИмяСвязанногоРегистраПоВидуИВ(ВидИВ) Экспорт	

// Возвращает имя документа расчетной методики для источника загрязнения.
//
// Параметры:
// ИсточникЗагрязнения - СправочникСсылка.ИсточникиЗагрязнения - Источник, для которого
// требуется получить имя документа расчетной методики.
//
// Возвращаемое значение:
// Структура - содержит ключи "ИмяДокумента" и "ИмяФормы".
//
Функция ПолучитьПараметрыДокументаРасчетнойМетодики(ИсточникЗагрязнения) Экспорт 
	
	Возврат Новый Структура("ИмяДокумента, ИмяФормы");
		
КонецФункции // ПолучитьИмяДокументаРасчетнойМетодики()

// Возвращает подчиненные элементы для источника загрязнения.
//
// Параметры:
// фпСсылка - СправочникСсылка.ИсточникиЗагрязнения - Источник, для которого
// требуется получить подчиненные элементы.
//
Функция НайтиПодчиненныеЭлементы( фпСсылка ) Экспорт

	текЗапрос	= Новый Запрос(
		"ВЫБРАТЬ
		|	ИсточникиЗагрязнения.Ссылка
		|ИЗ
		|	Справочник.ИсточникиЗагрязнения КАК ИсточникиЗагрязнения
		|ГДЕ
		|	НЕ ИсточникиЗагрязнения.ПометкаУдаления И
		|	ИсточникиЗагрязнения.Родитель = &Родитель" );
		
	текЗапрос.УстановитьПараметр( "Родитель",	фпСсылка );
	
	Возврат текЗапрос.Выполнить().Выгрузить().ВыгрузитьКолонку( "Ссылка" );
	
КонецФункции // Функция НайтиПодчиненныеЭлементы( фпСсылка ) Экспорт

// Возвращает площадь сечения выходного отверстия ИЗА
//
// Параметры:
//  ИсточникЗагрязненияСсылка  - СправочникСсылка.ИсточникиЗагрязнения - исчтоник загрязнения
// Возвращаемое значение:
//   число - площадь м2
//
Функция ПлощадьСеченияТрубы(ИсточникЗагрязненияСсылка) Экспорт
	Перем Результат, РеквизитыТрубы;
	
	РеквизитыТрубы = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ИсточникЗагрязненияСсылка, "ВидТрубы, ДлинаТруба, ШиринаТруба, Диаметр");
	
	Если РеквизитыТрубы.ВидТрубы = ПредопределенноеЗначение("Перечисление.ВидыТрубыИЗА.Круглая") Тогда
		Результат = 3.14 * РеквизитыТрубы.Диаметр * РеквизитыТрубы.Диаметр /4;
	ИначеЕсли РеквизитыТрубы.ВидТрубы = ПредопределенноеЗначение("Перечисление.ВидыТрубыИЗА.Прямоугольная") Тогда
	    Результат = РеквизитыТрубы.ДлинаТруба * РеквизитыТрубы.ШиринаТруба;
	Иначе
		Результат = 0;
	КонецЕсли; 
	
	Возврат Результат;

КонецФункции // ПлощадьСеченияТрубы()

#КонецОбласти
